//********************************************************************************************************
Функция СтруктураОтвета(Код, Сообщение = "")

	ЗаписьJSON = Новый ЗаписьJSON;
	
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
	
	ЗаписатьJSON(ЗаписьJSON, Новый Структура("code, data", Код, Сообщение)); 
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json");

	Ответ.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть());

	Возврат Ответ;

КонецФункции
//********************************************************************************************************
Функция status(Запрос)
	
	Возврат СтруктураОтвета(200);
	
КонецФункции
//********************************************************************************************************
