//*****************************************************************************
Функция ПустойОбъект(Ссылка)
	
	Возврат СтрНайти(Строка(Ссылка), "Объект не найден") > 0;
	
КонецФункции
//********************************************************************************************************
Функция СтруктураОтвета(Код, Сообщение = "")

	ЗаписьJSON = Новый ЗаписьJSON;
	
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
	
	ЗаписатьJSON(ЗаписьJSON, Новый Структура("code, data", Код, Сообщение)); 
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json");

	Ответ.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть());

	Возврат Ответ;

КонецФункции
//********************************************************************************************************
Функция maket(Запрос)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	
	ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку("UTF-8"));
	
	Данные = ПрочитатьJSON(ЧтениеJSON);
	
	ЧтениеJSON.Закрыть();
	
	Если Данные <> Неопределено Тогда
		
		Если Данные.Тип = "Документ" Тогда
			
			Документ = Документы[Данные.Вид].ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.Идентификатор));
			
			Если НЕ ПустойОбъект(Документ) Тогда
				
				ПечатныеФормы = УправлениеПечатью.СформироватьПечатныеФормы(Данные.Тип + "." + Данные.Вид, Данные.Макет, Документ, Неопределено); 
				
				ТабличныйДокумент = ПечатныеФормы.КоллекцияПечатныхФорм.Получить(0).ТабличныйДокумент;
				
				ПотокВПамяти = Новый ПотокВПамяти();
				
				ТабличныйДокумент.Записать(ПотокВПамяти, ТипФайлаТабличногоДокумента.MXL);
				
				ДвоичныеДанные = ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные();
				
				Возврат СтруктураОтвета(200, Base64Строка(ДвоичныеДанные));
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
	Возврат СтруктураОтвета(500);

КонецФункции
//********************************************************************************************************
